export default function MainItem7() {
  return (
    <div className="Blog">
      <section className="Blog-title">
        <h4>بلاگ</h4>
      </section>
      <section className="Blog-list row">
        <div className="Blog-item col-md-3 col-sm-6 col-12">
          <a href="//">
            <div
              style={{
                background:
                  "url(https://s.w.org/images/core/emoji/14.0.0/72x72/2705.png)",
              }}
            ></div>
            <h3>بهترین اپلیکیشن های آموزش زبان انگلیسی 📱 معرفی 7 برنامه</h3>
            <p>
              یادگیری زبان انگلیسی در صورتی که از منابع درست استفاده کنید، نه
              تنها سخت نیست، بلکه بسیار جذاب و آسان است. این روزها با توجه به
              پیشرفت تکنولوژی و افزایش استفاده از تلفن‌های همراه هوشمند،
              اپلیکیشن‌های زیادی برای یادگیری زبان انگلیسی ساخته شده است. اما
              همه آن‌ها را نمی‌توان در دسته برنامه‌های مناسب و کاربردی …
            </p>
          </a>
        </div>
        <div className="Blog-item col-md-3 col-sm-6 col-12">
          <a href="//">
            <div
              style={{
                background:
                  "url(https://zabanmehrpub.com/blog/wp-content/uploads/2023/10/ielts-retake.png)",
              }}
            ></div>
            <h3>
              جزئیات آزمون مجدد تک مهارتی آیلتس 2023 ❤️ IELTS one skill retake
            </h3>
            <p>
              آزمون مجدد تک مهارتی آیلتس | IELTS one skill retake آزمون آیلتس از
              جمله آزمون‌های معتبر و شناخته شده در جهان است که توانایی‌های زبان
              انگلیسی فرد را ارزیابی می‌کند. این آزمون چهار بخش مهارتی دارد:
              Listening, Speaking, Writing, Reading. گاهی اوقات ممکن است شما در
              یک یا چند بخش از این مهارت‌ها نمره کمتری …
            </p>
          </a>
        </div>
        <div className="Blog-item col-md-3 col-sm-6 col-12">
          <a href="//">
            <div
              style={{
                background:
                  "url(https://zabanmehrpub.com/blog/wp-content/uploads/2023/10/American-Family-and-Friends-2nd-Collection-2.jpg)",
              }}
            ></div>
            <h3>بهترین کتاب‌های آموزش انگلیسی برای کودکان ❤️ معرفی 5 مجموعه</h3>
            <p>
              هر کودکی با جهان خودش، رویاها و خواسته‌هایی ویژه به دنیا می‌آید.
              یادگیری زبان انگلیسی، می‌تواند پلی باشد تا کودکان با دنیایی جدید و
              گسترده‌تر آشنا شوند و بتوانند رویاهای خود را به واقعیت تبدیل کنند.
              وقتی قصد داریم به فرزندمان زبان انگلیسی آموزش دهیم، شناخت بهترین
              کتاب زبان انگلیسی برای کودکان بسیار حیاتی است. …
            </p>
          </a>
        </div>
        <div className="Blog-item col-md-3 col-sm-6 col-12">
          <a href="//">
            <div
              style={{
                background:
                  "url(https://zabanmehrpub.com/blog/wp-content/uploads/2023/08/simon-says-300x225.jpg)",
              }}
            ></div>
            <h3>آموزش زبان انگلیسی به کودکان با بازی های جذاب و موثر</h3>
            <p>
              آموزش زبان به کودکان در سنین پیش‌دبستانی می‌تواند با چالش‌هایی
              روبرو شود، اما با رویکردی نوآورانه و جذاب می‌توان این فرآیند را به
              یک تجربه مثبت و مؤثر تبدیل کرد.آموزش زبان انگلیسی به کودکان با
              بازی، علاوه بر ایجاد شادی و سرگرمی، امکان یادگیری در محیط غیردرسی
              را فراهم می‌کند و اجازه می‌دهد تا کودک …
            </p>
          </a>
        </div>
      </section>
    </div>
  );
}
