import { useState } from "react";

export default function MainItem8() {
  const [showText1, setShowText1] = useState(false);

  function ShowText1() {
    setShowText1((current) => !current);
  }

  return (
    <div className="Introducing-zabanMehr">
      <div
        className="Introducing-zabanMehr-content"
        style={{ maxHeight: showText1 ? "100%" : "220px" }}
      >
        <p>
          <a href="//">
            <strong>خرید کتاب زبان</strong>
          </a>
          یکی از مسائل مهم و چالش برانگیز برای زبان آموزان محسوب می شود. استفاده
          از منابع مناسب می تواند تاثیرات بسزایی در یادگیری زبان داشته باشد.
          افراد به دلایل مختلف مانند مهاجرت تحصیلی یا کاری، ارتقاء شغلی، علاقه
          شخصی و … نیاز به فراگیری زبان دارند؛ به همین دلیل به سراغ خرید کتاب
          زبان برای یادگیری به صورت خودآموز و یا با کمک کلاس ها و دوره های مختلف
          می روند.
        </p>
        <p>
          <strong>زبانمهر</strong>
          یکی از بهترین و معتبرترین مجموعه های ارائه دهنده خدمات آموزشی و منابع
          مناسب آموزش زبان در ایران می باشد. زبان آموزانی که قصد خرید کتاب زبان
          را دارند می توانند با مراجعه به فروشگاه اینترنتی زبانمهر که دارای کامل
          ترین بانک کتاب های زبان خارجی در ایران است، مناسبترین کتاب را تهیه
          کنند.
        </p>
        <p>
          در زبانمهر امکان خرید انواع کتاب های آموزشی موضوعی و درسی،
          <a href="//">
            <b>خرید کتاب رمان انگلیسی</b>
          </a>
          و کتاب داستان، کتاب های خودآموز، کتاب های ادبی، کتاب های تمرینی، کتاب
          های آموزشگاهی و دیگر کتاب ها و منابع کاربردی وجود دارد برای خرید کتاب
          زبان از سایت فروشگاه اینترنتی زبانمهر کار راحتی در پیش رو خواهید داشت؛
          زیرا در این سایت انواع کتاب زبان در دسته بندی های متفاوت قرار گرفته و
          جستجو و پیدا کردن کتاب مورد نظر امری ساده و بدون دردسر می باشد.
        </p>
        <div>
          <p>
            <strong>اهمیت خرید کتاب زبان،</strong>
            کتاب ها و منابع آموزشی جزو اساسی ترین ابزارهای فراگیری زبان محسوب می
            شوند و بدون آنها نمی توان پیشرفت و موفقیت لازم را کسب نمود. انواع
            مختلفی از کتاب زبان با متدهای آموزشی متفاوت وجود دارد که شما هنگام
            خرید کتاب زبان باید بهترین و مناسبترین کتاب را با توجه به فاکتورهایی
            همچون سطح دانش خود از زبان، سطح کتاب، هدف یادگیری، کیفیت کتاب و …
            انتخاب کنید.
          </p>
          <p>
            زبانمهر به عنوان یکی از مجموعه های معتبر ارائه دهنده کتاب های زبان
            خارجی، انواع کتاب ها و منابع را در سطوح مختلف و با بهترین کیفیت در
            اختیار زبان آموزان قرار می دهد. شما می توانید با خرید کتاب زبان از
            زبانمهر به صورت اینترنتی و یا حضوری آموزش خود را به صورت جدی و در
            بهترین سطح دنبال کنید و به درجات بالا برسید.
          </p>
          <div>
            <p>
              خرید کتاب زبان اصلی از فروشگاه زبانمهر مزایای خوبی بهمراه دارد که
              از مهمترین آنها می توان به موارد زیر اساره نمود:
            </p>
            <p>
              <strong>1. تنوع بالای محصولات</strong>
            </p>
            <p>
              زبانمهر مجموعه کاملی از کتاب های آموزش زبان را با دسته بندی های
              متنوع براساس رده سنی، سطح دانش، موضوعات گوناگون و … به زبان آموزان
              و مدرسان ارائه می دهد. این مجموعه تمام نیازهای شما را در زمینه
              منابع و کتاب های زبان پوشش می دهد. همچنین، با داشتن تعداد بالایی
              از کتاب های زبان به عنوان یکی از بهترین و معتبرترین مراجه خرید
              کتاب زبان محسوب می گردد. به محض ورود به سایت زبانمهر با دنیایی از
              کتاب رو به رو می‌شوید و هر آنچه که نیاز دارید و به ذهن شما خطور
              می‌ کند در اینجا پیدا خواهید کرد.
            </p>
            <p>
              <strong>2. ارسال سریع و به موقع</strong>
            </p>
            <p>
              از دیگر مزایای خرید کتاب زبان از زبانمهر می توان به ارسال به موقع
              در کمترین زمان اشاره نمود. در هر کجای کشور که باشید می توانید با
              مراجعه به سایت زبانمهر کتاب مورد نظر خود را با چندین کلیک ساده
              خریداری نموده و پس از مدت زمان کوتاهی آن را در بسته بندی های مناسب
              و استاندارد و هیجان انگیز درب منزل خود تحویل بگیرید.
            </p>
            <p>
              <strong>3. کیفیت بالا و قیمت مناسب</strong>
            </p>
            <p>
              زبانمهر با بیش از 15 سال تجربه و سابقه در زمینه ارائه منابع و کتاب
              های آموزشی زبان همیشه سعی نموده بهترین و باکیفیت ترین کتاب ها را
              در اختیار زبان آموزان عزیز قرار دهد. کیفیت چاپ بالا، تضمین اصلی
              بودن کتاب ها، ضمانت بازگشت کتاب و قیمت مناسب از مزایای خرید کتاب
              زبان اصلی از فروشگاه اینترنتی زبانمهر محسوب می شوند. در این مجموعه
              سعی بر آن شده انواع کتاب های زبان در دسته بندی های مختلف با بهترین
              و بالاترین کیفیت از جنبه های مختلف عرضه گردد تا زبان آموزان
              بتوانند با رضایت خاطر فراگیری زبان را ادامه دهند.
            </p>
            <p>
              <strong>4. پشتیبانی حرفه‌ای</strong>
            </p>
            <p>
              تیم پشتیبانی زبانمهر متشکل از افرادی باتجربه و ماهر در زمینه آموزش
              زبان می باشند که در هر زمان پاسخگوی سوالات زبان آموزان و کاربران
              هستند. زبان آموزان می توانند با دریافت مشاوره و راهنمایی های لازم
              از تیم پشتیبانی هنگام خرید کتاب زبان بهترین انتخاب را با توجه به
              شرایط خود داشته باشند.
            </p>
            <p>
              <strong>محصولات زبانمهر،</strong>
            </p>
            <p>
              در زبانمهر می‌توانید انواع کتاب زبان را در دسته‌بندی‌های
              <a href="//" title="کتاب زبان انگلیسی">
                <strong>کتاب زبان انگلیسی</strong>
              </a>
              ،
              <a href="//" title="کتاب زبان آلمانی">
                <strong>آلمانی</strong>
              </a>
              ،
              <a href="//" title="کتاب زبان فرانسوی">
                <strong>فرانسوی</strong>
              </a>
              ،
              <a href="//" title="کتاب زبان ترکی">
                <strong>ترکی</strong>
              </a>
              ،
              <a href="//" title="کتاب زبان ایتالیایی">
                <strong>ایتالیایی</strong>
              </a>
              ،
              <a href="//" title="کتاب زبان اسپانیایی">
                <strong>اسپانیایی</strong>
              </a>
              ، روسی، چینی، عربی و … بیابید. در حال حاضر فروشگاه اینترنتی
              زبانمهر کامل‌ترین بانک کتاب‌های زبان خارجه در ایران است. ارسال
              سریع، ارائه بهترین قیمت و جذب رضایت کامل مشتری‌ها از مهم‌ترین
              هدف‌های ماست.
            </p>
          </div>
        </div>
      </div>
      <div className="Introducing-zabanMehr-ShowMoreBTN">
        <a onClick={ShowText1}>
          <span>مشاهده بیشتر</span>
          <span style={{ marginRight: "5px" }}>
            <img
              src="https://zabanmehrpub.com/wp-content/uploads/2023/08/chevron-down-black.svg"
              alt=""
              className=""
            />
          </span>
        </a>
      </div>
    </div>
  );
}
